# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [2]:
employee = pd.read_csv('Employee.csv')
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [3]:
print(employee.dtypes)

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [5]:
"""
There are two columns that contain integer value which can be used for performing numerical analysis. 
The other columns contain object type of data which can be used in categorical analysis like grouping,
aggregation, encoding for machine learning algorithms."""

#### What's the average salary in this company?

In [6]:
average_salary = employee['Salary'].mean()
print("Average salary is:", average_salary)

Average salary is: 48.888888888888886

#### What's the highest salary?

In [7]:
highest_salary = employee['Salary'].max()
print("Highest salary is:",highest_salary)

Highest salary is: 70

#### What's the lowest salary?

In [8]:
lowest_salary = employee['Salary'].min()
print("Lowest salary is:",lowest_salary)

Lowest salary is: 30

#### Who are the employees with the lowest salary?

In [9]:

lowest_salary_names = employee[employee['Salary'] == lowest_salary]
print(lowest_salary_names[['Name','Salary']])

    Name  Salary
1  Maria      30
2  David      30

#### Find all the information about an employee called David.

In [13]:
David = employee[employee['Name'] == 'David']
David

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [12]:
David_salary = employee[employee['Name'] == 'David']['Salary']
David_salary

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [14]:

associate_title = employee[employee['Title'] == 'associate']
associate_title

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [15]:
# Method 1
employee.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [16]:
# Method 2
first_3rows = employee.iloc[:3, :]
print(first_3rows)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [17]:

associate_above_55 = employee[(employee['Title'] == 'associate') & (employee['Salary'] > 55)]
associate_above_55

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [18]:
average_salaries_by_years = employee.groupby('Years')['Salary'].mean()
print("Average salaries by number of year of employment per group:")
print(average_salaries_by_years)

Average salaries by number of year of employment per group:
Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [19]:
average_salary_per_title = employee.groupby('Title').mean()
average_salary_per_title

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [20]:
quartiles = employee['Salary'].quantile([0.25, 0.5, 0.75])
print(quartiles)

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

In [21]:
# also possible to use describe function to show more details; mean, max, min, and quartiles

employee.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Is the mean salary different per gender?

In [23]:
salary_different_per_gender = employee.groupby('Gender')['Salary'].mean()
print("Average salary per gender:")
print(salary_different_per_gender)

Average salary per gender:
Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [24]:
min_mean_max = employee.groupby('Department').agg({
    'Salary': ['min', 'mean', 'max'],
    'Years': ['min', 'mean', 'max'],
})

display(min_mean_max)

           Salary            Years
              min   mean max   min      mean max
Department
HR             30  45.00  70     2  4.666667   8
IT             30  48.75  70     1  4.500000   8
Sales          55  55.00  55     2  2.500000   3

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [26]:
salary_difference = employee.groupby('Department')['Salary'].agg(lambda x: x.max() - x.min())
print(salary_difference)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here